package com.company;

public class Main {

    public static void main(String[] args) {
	String знак_зодиака= "Рыбы";
	switch (знак_зодиака)
    {
        case "Овен":
            System.out.println("Не торопите события – поспешные действия могут вызвать сильное разочарование и привести \n" +
                    " к неприятностям и переживаниям. Лучше используйте этот день для приятного времяпровождения – даже \n" +
                    " ничего не значащие, на первый взгляд, встречи и знакомства, принесут вам сегодня радость и дадут \n" +
                    " немало поводов для счастья. День идеально подходит для общения, встреч, налаживания контактов \n" +
                    " и звонков близким людям, которых вы давно не видели.");
            break;
        case "Близнецы":
            System.out.println("Близнецов отличаются особой двойственностью и непостоянством. Они способны воспринимать \n" +
                    " окружающий мир с двух сторон, порой даже не понимая самих себя. Близнецы куда переменчивее погоды. \n" +
                    " Они могли бы считаться абсолютно несносными, если б не были так привлекательны и общительны. \n" +
                    " Близнецы любят вести беседы, они охотно делятся своими впечатлениями, и люди их внимательно слушают. \n " +
                    "Все в жизни Близнецов двойственно, с одной стороны, судьба наделяет их непостоянством в намерениях, \n" +
                    " с другой - посылает им испытания, в которых Близнецы обретают, упорство и целеустремленность.");
            break;
        case "Лев":
            System.out.println("Львов можно охарактеризовать как ленивых, но в то же время амбициозных личностях. \n " +
                    "Стремление достичь высот во всем преследует Львов на протяжении всей жизни, но скорее ждет удачи от судьбы, \n" +
                    " чем добиваться ее; когда удача наконец находит Льва, он принимает это как должное. \n" +
                    "На окружающих Львы смотрят свысока оценочным взглядом, и на любую критику к своей персоне реагируют остро \n" +
                    " и болезненно. Дело в том, что представители данного знака попросту не видят рядом с собой людей, \n" +
                    " которые смогли бы достойно оценить их поведение.Люди, родившиеся под знаком Льва, как правило, \n" +
                    " оценивают только материальные блага, потому что материалистичность для них чуть ли не на первом месте");
            break;
        case "Весы":
            System.out.println("Весы - скромны, вежливы, обаятельны и дружелюбны. Они не будут обижаться по пустякам и будут \n" +
                    " стараться не причинять боль близким. Они могут предсказывать будущее, особенно в сочетании с их легким, \n" +
                    " не омраченным мистическими предчувствиями характером. Они кажутся счастливыми и радостными, милыми, \n" +
                    " и открытыми для общения, однако этот знак весьма противоречив, и в некоторые жизненные моменты  \n" +
                    "они превращаются в настоящих тиранов");
            break;
        case "Стрелец":
            System.out.println("Стрельцы почти всегда активны, умны до глубокой зрелости. В них царит гармония, и поэтому \n " +
                    "часто пребывают в хорошем настроении. Они ценят свободу и легкость. Любое ограничение свободы воспринимается \n" +
                    " в штыки. Доброта и искренность Стрельцов, к сожалению, уравновешиваются чрезмерной эмоциональностью. \n" +
                    "Помимо этого, они впадают в крайности, наживая врагов то явной откровенностью, то бесполезной борьбой \n" +
                    " за правду. Стоит отметить, что Стрельцы чаще отстаивают чужие права, чем свои; они чувствуют \n" +
                    " немалую ответственность за окружающих и нередко навязывают им своей опеку");
            break;
        case "Водолей":
            System.out.println("Водолея характеризует выраженная чувствительность и ранимость. Вокруг них много людей, но в душе \n" +
                    "они одиноки. Стоит отметить, что Водолеи притягивают к себе неуравновешенных людей, склонных к неадекватным \n" +
                    "поступкам. Что касается дружбы, то представители этого знака, предпочитают выбирать друзей навсегда. \n" +
                    "Водолеи очень общительны, иногда до навязчивости. Впрочем, они из той категории людей, которые редко меняет \n" +
                    " свое мнение, но поддаются на уговоры. Злоупотреблять этим качеством не стоит: если Водолей посчитает \n" +
                    "себя оскорбленным или ущемленным, он обязательно будет мстить, несмотря на риски навредить самому себе.");
            break;
        case "Телец":
            System.out.println("Телец - второй представитель знака Зодиака, который обладает благородным и стойким характером. \n" +
                    "Имея большую силу, они, не спешат ее тратить, дожидаясь подходящего момента. Упорный труд, а не везение, \n" +
                    " постоянство, а не порыв - вот жизненное кредо Тельцов. \n" +
                    "В решениях, как и в поступках, Тельцы обычно неторопливы. Хорошо, если они могут размышлять и принимать \n" +
                    "решения в одиночестве - люди данного знака ни за что не будут поддаваться чужому влиянию. \n" +
                    " Иногда они позволяют себе принимать чужие мысли за свои.");
            break;
        case "Рак":
            System.out.println("Представители знака Рак, обладают выраженной чувствительностью – даже нелепая шутка, сказанная \n" +
                    " в их сторону, может стать причиной депрессии; при этом Рак обладает хорошей внутренней энергией, \n" +
                    "и он быстро может адаптироваться после угнетенного состояния. Не стоит считать Раков меланхоликами, \n" +
                    "ведь шутить они любят, и делают это не хуже других. \n" +
                    "Жизнь Рака представляет собой светлые и темные полосы, при этом, даже при самых хороших моментах, \n" +
                    "люди данного знака иногда предпочитают сделать паузу и воспользоваться затишьем, чтобы обдумать \n" +
                    "и принять решение. Они берут не упрямством, а хитростью, не агрессивностью, а измором.");
            break;
        case "Дева":
            System.out.println("С первого взгляда покажется, что Девы озабочены своими материальными проблемами, но это не так. \n" +
                    " На самом деле они очень внимательны и непроизвольно отмечают несовершенства этого мира, особенно в тех \n" +
                    " сферах, где исправить ситуацию в их силах. Представители этого знака очень чистоплотны, и любят \n" +
                    " совершенство, и пусть оно будет не во всем мире, но в своем уголке уж точно. \n" +
                    "Девы умны, они обладают как логикой, так и интуицией, но часто слишком трепетны по отношению к миру \n" +
                    " и окружающим и позволяют себе острые высказывания, из-за которых теряют друзей и близких. \n" +
                    "Девы имеют свое мнение, но отстаивают свое только в споре с достойными и интересными оппонентами; \n" +
                    " доказывать что-то глупому и неинтеллигентному человеку, они не станут.");
            break;
        case "Скорпион":
            System.out.println("Скорпион, пожалуй, один из самых загадочных знаков Зодиака; среди них есть материалисты и мистики, \n" +
                    " гуманисты и падкие на собственные страсти, умны и глупы. Встретив на своем пути Скорпиона, Вы можете \n" +
                    " быть уверены в одном - с ним не будет скучно, но зато будет опасно. В любом случае, это не тот человек, \n" +
                    " в присутствии которого можно расслабиться");
            break;
        case "Козерог":
            System.out.println("Козерогов характеризует жизненная стойкость и упрямое стремление к лучшему результату во всем. \n" +
                    "Они очень горды за свой ум, и несмотря на лень, прилагают массу усилий для саморазвития. Козероги - знак, \n" +
                    " который предпочитает учиться всю жизнь. \n" +
                    "У Козерогов непросто складываются взаимоотношения с людьми: они очень горды и кажутся через чур уверенными \n" +
                    " в себе, но иногда сильно страдают из-за того, что не умеют добиться расположения окружающих и отстаивать \n" +
                    " свою точку зрения. С другой стороны, Козероги склонны довольствоваться узким кругом общения. Кроме того, \n" +
                    "они ненавидят зависеть от кого-то, и потому предпочтут одиночество чем нахождение в компании \n" +
                    " малознакомых людей. \n" +
                    "Представители данного знака по своей натуре эгоисты, но несмотря на это, не считают себя лучше других; \n" +
                    " более того, многим Козерогам всю жизнь приходится бороться со своими комплексами.");
            break;
        case "Рыбы":
            System.out.println("Одна из отличительных особенностей Рыб - умение взглянуть на себя с разных сторон и оценить свои \n" +
                    " сильные и слабые стороны. Они отлично понимают, что им по силам, а что нет, представители этого знака \n" +
                    " относятся к себе с некой иронией, а вот от других требуют серьезности");
            break;
        default:
            System.out.println("Неверно указан знак зодиака");

    }

    }
}
